Revit 2026 API

# FamilyItemFactory Properties

---

The FamilyItemFactory type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

#### Reference

FamilyItemFactory Class

Autodesk.Revit.Creation Namespace